import numpy as np

a=np.array([[1.0,2.0],[3.0,4.0]])
print(a)
# [[ 1.  2.]
#  [ 3.  4.]]
a.transpose()#没改变a
# [[ 1.,  3.],
#  [ 2.,  4.]]
np.linalg.inv(a)#矩阵的逆
# [[-2. ,  1. ],
#  [ 1.5, -0.5]]
u=np.eye(3)#2维的单位矩阵 eye=1
# [[ 1.,  0.],
#  [ 0.,  1.]]

j=np.array([[0.0,-1.0],[1.0,0.0]])
np.dot(i,j)
# ([[-1.,  0.],
#   [ 0., -1.]]
np.trace(u)#返回数组对角线的总和。
#2
y=np.aray([[5.],[7.]])
np.linalg.solve(a,y)#线性矩阵方程的解
# [[-3.],
#  [ 4.]]
np.linalg.eig(j)#计算正方形阵列的特征值和特征向量
# array([ 0.+1.j,  0.-1.j]), array([[ 0.70710678+0.j, 0.70710678-0.j],
# [ 0.00000000-0.70710678j,  0.00000000+0.70710678j]])
